{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "blocks.7.self_attn.v",
    "26.cross_attn.q",
    "26.self_attn.o",
    "15.cross_attn.q",
    "blocks.4.self_attn.o",
    "blocks.2.cross_attn.v",
    "31.cross_attn.v",
    "36.self_attn.k",
    "blocks.1.ffn.0",
    "16.ffn.0",
    "38.self_attn.o",
    "35.cross_attn.k",
    "15.cross_attn.v",
    "39.ffn.2",
    "19.cross_attn.q",
    "36.cross_attn.v",
    "21.cross_attn.k",
    "9.ffn.2",
    "28.cross_attn.o",
    "36.self_attn.v",
    "blocks.5.self_attn.v",
    "37.ffn.0",
    "14.cross_attn.o",
    "33.self_attn.k",
    "8.self_attn.o",
    "32.self_attn.q",
    "39.self_attn.v",
    "18.self_attn.q",
    "blocks.7.cross_attn.v",
    "30.cross_attn.q",
    "25.self_attn.k",
    "36.ffn.2",
    "12.cross_attn.o",
    "16.ffn.2",
    "25.cross_attn.o",
    "24.cross_attn.o",
    "11.self_attn.o",
    "blocks.6.self_attn.o",
    "18.cross_attn.q",
    "30.self_attn.o",
    "blocks.3.self_attn.q",
    "22.self_attn.q",
    "39.cross_attn.v",
    "20.self_attn.o",
    "35.cross_attn.q",
    "10.self_attn.q",
    "29.ffn.2",
    "31.self_attn.k",
    "15.self_attn.o",
    "9.cross_attn.v",
    "22.ffn.2",
    "25.self_attn.v",
    "blocks.4.ffn.2",
    "30.ffn.0",
    "30.cross_attn.o",
    "34.cross_attn.v",
    "10.cross_attn.q",
    "9.cross_attn.q",
    "27.self_attn.k",
    "blocks.1.ffn.2",
    "34.ffn.2",
    "22.cross_attn.q",
    "28.self_attn.o",
    "33.ffn.0",
    "blocks.3.ffn.0",
    "blocks.1.cross_attn.v",
    "11.ffn.0",
    "blocks.1.self_attn.q",
    "10.ffn.2",
    "34.self_attn.k",
    "21.cross_attn.o",
    "36.ffn.0",
    "25.cross_attn.k",
    "31.self_attn.o",
    "blocks.2.self_attn.k",
    "37.ffn.2",
    "35.cross_attn.o",
    "9.self_attn.o",
    "blocks.6.self_attn.k",
    "34.self_attn.o",
    "blocks.5.ffn.2",
    "blocks.0.self_attn.q",
    "38.self_attn.k",
    "29.self_attn.o",
    "blocks.6.ffn.2",
    "14.self_attn.v",
    "12.self_attn.q",
    "23.ffn.2",
    "31.cross_attn.k",
    "blocks.4.ffn.0",
    "13.ffn.2",
    "12.cross_attn.k",
    "24.self_attn.k",
    "31.cross_attn.o",
    "24.self_attn.v",
    "10.self_attn.o",
    "23.self_attn.k",
    "14.ffn.2",
    "blocks.5.cross_attn.o",
    "33.cross_attn.k",
    "27.cross_attn.k",
    "38.cross_attn.o",
    "17.self_attn.o",
    "29.self_attn.k",
    "8.ffn.0",
    "13.cross_attn.k",
    "18.self_attn.v",
    "16.self_attn.q",
    "24.ffn.2",
    "29.self_attn.v",
    "blocks.0.cross_attn.o",
    "17.cross_attn.q",
    "13.cross_attn.o",
    "39.self_attn.q",
    "k_img",
    "19.cross_attn.o",
    "blocks.5.ffn.0",
    "13.cross_attn.q",
    "37.cross_attn.q",
    "blocks.1.cross_attn.q",
    "38.self_attn.q",
    "35.cross_attn.v",
    "20.self_attn.k",
    "10.cross_attn.v",
    "28.ffn.2",
    "13.self_attn.q",
    "37.self_attn.k",
    "37.self_attn.q",
    "blocks.3.cross_attn.q",
    "19.cross_attn.v",
    "blocks.7.cross_attn.k",
    "blocks.6.cross_attn.k",
    "26.cross_attn.o",
    "36.cross_attn.k",
    "11.cross_attn.o",
    "24.cross_attn.q",
    "28.self_attn.k",
    "28.self_attn.q",
    "38.cross_attn.q",
    "36.cross_attn.q",
    "9.cross_attn.o",
    "blocks.0.cross_attn.v",
    "13.self_attn.o",
    "12.cross_attn.v",
    "15.self_attn.q",
    "8.self_attn.k",
    "35.self_attn.q",
    "19.self_attn.k",
    "10.self_attn.v",
    "11.ffn.2",
    "8.cross_attn.q",
    "39.ffn.0",
    "13.ffn.0",
    "23.cross_attn.q",
    "blocks.0.self_attn.k",
    "21.self_attn.v",
    "24.cross_attn.v",
    "blocks.3.cross_attn.o",
    "blocks.6.self_attn.q",
    "34.self_attn.q",
    "16.self_attn.o",
    "15.cross_attn.o",
    "blocks.7.cross_attn.o",
    "17.self_attn.v",
    "blocks.5.self_attn.o",
    "33.cross_attn.q",
    "28.cross_attn.v",
    "blocks.5.cross_attn.v",
    "blocks.0.self_attn.v",
    "36.cross_attn.o",
    "blocks.6.ffn.0",
    "v_img",
    "blocks.4.self_attn.v",
    "19.ffn.0",
    "11.cross_attn.k",
    "37.cross_attn.k",
    "39.cross_attn.o",
    "30.self_attn.q",
    "27.cross_attn.v",
    "12.self_attn.v",
    "33.self_attn.o",
    "21.ffn.2",
    "blocks.0.cross_attn.k",
    "18.cross_attn.o",
    "26.ffn.2",
    "33.cross_attn.o",
    "blocks.1.self_attn.k",
    "20.cross_attn.k",
    "23.ffn.0",
    "39.self_attn.k",
    "37.cross_attn.o",
    "12.ffn.2",
    "14.ffn.0",
    "16.cross_attn.v",
    "25.ffn.2",
    "9.self_attn.q",
    "36.self_attn.q",
    "22.self_attn.v",
    "21.self_attn.k",
    "blocks.3.self_attn.k",
    "29.cross_attn.o",
    "blocks.4.cross_attn.o",
    "38.cross_attn.k",
    "31.ffn.2",
    "22.self_attn.k",
    "20.ffn.2",
    "17.cross_attn.o",
    "35.self_attn.v",
    "14.cross_attn.v",
    "blocks.2.cross_attn.k",
    "blocks.5.self_attn.q",
    "38.cross_attn.v",
    "30.cross_attn.k",
    "blocks.3.ffn.2",
    "9.ffn.0",
    "15.self_attn.v",
    "8.cross_attn.v",
    "11.self_attn.v",
    "32.self_attn.k",
    "32.cross_attn.v",
    "20.self_attn.q",
    "blocks.5.self_attn.k",
    "blocks.2.cross_attn.q",
    "28.self_attn.v",
    "39.cross_attn.k",
    "16.self_attn.v",
    "23.self_attn.o",
    "22.cross_attn.v",
    "20.cross_attn.v",
    "10.cross_attn.k",
    "18.cross_attn.v",
    "blocks.2.ffn.0",
    "12.ffn.0",
    "20.cross_attn.q",
    "33.self_attn.q",
    "blocks.7.ffn.0",
    "29.self_attn.q",
    "blocks.0.ffn.0",
    "blocks.1.self_attn.v",
    "25.cross_attn.q",
    "15.self_attn.k",
    "10.self_attn.k",
    "21.ffn.0",
    "18.ffn.2",
    "21.self_attn.q",
    "22.self_attn.o",
    "blocks.5.cross_attn.k",
    "22.cross_attn.o",
    "blocks.2.self_attn.q",
    "blocks.6.cross_attn.q",
    "19.ffn.2",
    "35.self_attn.k",
    "30.ffn.2",
    "24.self_attn.o",
    "17.self_attn.q",
    "10.ffn.0",
    "blocks.1.self_attn.o",
    "23.cross_attn.k",
    "35.ffn.0",
    "17.cross_attn.k",
    "23.cross_attn.o",
    "blocks.2.cross_attn.o",
    "21.cross_attn.v",
    "26.cross_attn.v",
    "blocks.1.cross_attn.k",
    "14.self_attn.o",
    "15.ffn.2",
    "30.self_attn.k",
    "21.cross_attn.q",
    "37.self_attn.o",
    "32.self_attn.v",
    "blocks.7.cross_attn.q",
    "38.ffn.0",
    "11.self_attn.q",
    "blocks.7.self_attn.k",
    "19.cross_attn.k",
    "30.self_attn.v",
    "blocks.2.ffn.2",
    "20.cross_attn.o",
    "32.cross_attn.k",
    "19.self_attn.o",
    "26.cross_attn.k",
    "18.self_attn.o",
    "blocks.4.cross_attn.k",
    "36.self_attn.o",
    "16.cross_attn.q",
    "blocks.5.cross_attn.q",
    "13.self_attn.v",
    "13.self_attn.k",
    "31.cross_attn.q",
    "blocks.0.cross_attn.q",
    "27.self_attn.q",
    "26.self_attn.k",
    "14.self_attn.q",
    "9.self_attn.v",
    "27.ffn.2",
    "19.self_attn.v",
    "blocks.7.ffn.2",
    "blocks.4.cross_attn.v",
    "blocks.4.cross_attn.q",
    "blocks.1.cross_attn.o",
    "32.cross_attn.q",
    "blocks.3.cross_attn.v",
    "35.self_attn.o",
    "blocks.7.self_attn.o",
    "19.self_attn.q",
    "25.ffn.0",
    "8.cross_attn.o",
    "25.self_attn.q",
    "14.self_attn.k",
    "35.ffn.2",
    "9.cross_attn.k",
    "37.cross_attn.v",
    "16.cross_attn.k",
    "28.cross_attn.q",
    "8.self_attn.v",
    "11.cross_attn.v",
    "39.cross_attn.q",
    "32.cross_attn.o",
    "blocks.6.cross_attn.o",
    "32.ffn.0",
    "14.cross_attn.q",
    "29.cross_attn.q",
    "22.cross_attn.k",
    "22.ffn.0",
    "blocks.2.self_attn.v",
    "13.cross_attn.v",
    "11.cross_attn.q",
    "blocks.6.self_attn.v",
    "20.ffn.0",
    "17.ffn.0",
    "12.self_attn.k",
    "34.ffn.0",
    "17.cross_attn.v",
    "blocks.3.self_attn.o",
    "8.self_attn.q",
    "34.self_attn.v",
    "28.cross_attn.k",
    "31.self_attn.v",
    "33.self_attn.v",
    "blocks.4.self_attn.q",
    "37.self_attn.v",
    "25.cross_attn.v",
    "23.cross_attn.v",
    "18.self_attn.k",
    "blocks.2.self_attn.o",
    "29.cross_attn.k",
    "17.ffn.2",
    "29.ffn.0",
    "16.cross_attn.o",
    "24.self_attn.q",
    "32.ffn.2",
    "9.self_attn.k",
    "blocks.6.cross_attn.v",
    "10.cross_attn.o",
    "32.self_attn.o",
    "27.ffn.0",
    "blocks.0.self_attn.o",
    "30.cross_attn.v",
    "31.self_attn.q",
    "14.cross_attn.k",
    "24.ffn.0",
    "blocks.7.self_attn.q",
    "34.cross_attn.q",
    "16.self_attn.k",
    "21.self_attn.o",
    "12.self_attn.o",
    "blocks.4.self_attn.k",
    "26.ffn.0",
    "25.self_attn.o",
    "23.self_attn.q",
    "24.cross_attn.k",
    "34.cross_attn.k",
    "26.self_attn.q",
    "33.ffn.2",
    "8.ffn.2",
    "15.ffn.0",
    "28.ffn.0",
    "23.self_attn.v",
    "27.self_attn.o",
    "20.self_attn.v",
    "11.self_attn.k",
    "27.self_attn.v",
    "38.self_attn.v",
    "18.ffn.0",
    "blocks.3.cross_attn.k",
    "27.cross_attn.o",
    "18.cross_attn.k",
    "29.cross_attn.v",
    "12.cross_attn.q",
    "31.ffn.0",
    "27.cross_attn.q",
    "blocks.3.self_attn.v",
    "blocks.0.ffn.2",
    "38.ffn.2",
    "8.cross_attn.k",
    "15.cross_attn.k",
    "17.self_attn.k",
    "33.cross_attn.v",
    "26.self_attn.v",
    "39.self_attn.o",
    "34.cross_attn.o"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}